# Tap
tap 'homebrew/cask'
tap 'homebrew/cask-fonts'
tap 'homebrew/cask-versions'

# Div
brew 'coreutils' #GNU software containing implementations for many of the basic tools, such as cat, ls, and rm
brew 'git'
brew 'cask'
brew 'maven'
brew 'maven-completion'
brew 'fish'
brew 'starship'
brew 'kotlin'

# Casks
cask 'slack'
cask 'google-chrome'
cask 'iterm2'
cask 'visual-studio-code'
cask 'jetbrains-toolbox'

# Temurin Java
cask 'temurin'
cask 'temurin17'
cask 'temurin11'
