# Tap
tap 'homebrew/cask'
tap 'homebrew/cask-fonts'
tap 'homebrew/cask-versions'
tap 'hashicorp/tap'

# Div
brew 'coreutils'
brew 'git'
brew 'cask'
brew 'maven'
brew 'maven-completion'
brew 'fish'
brew 'starship'
brew 'kotlin'
brew 'postgresql@15'
brew 'python3'
brew 'kubernetes-cli'
brew 'jq'
brew 'imagemagick' # Used by TOMRA service-portal
brew 'cloud-sql-proxy'
brew 'rsync' # get the latest version
brew 'jmeter'
brew 'opentofu'
brew 'hashicorp/tap/terraform'
brew 'openssl@3' # Need for DSMD root CA generation with easyrsa.

# Casks
cask 'slack'
cask 'google-chrome'
cask 'iterm2'
cask 'visual-studio-code'
cask 'jetbrains-toolbox'
cask 'docker'
cask 'spotify'
cask 'google-cloud-sdk'
cask 'alfred'
cask 'postman'
cask 'microsoft-remote-desktop'
cask 'logitech-options'
cask 'obsidian'
cask 'displaylink'
cask 'cyberduck'

# Temurin Java
cask 'temurin'
cask 'temurin@17'
cask 'temurin@21'

