# Tap
tap 'homebrew/cask'
tap 'homebrew/cask-fonts'
tap 'homebrew/cask-versions'

# Div
brew 'coreutils'
brew 'git'
brew 'cask'
brew 'maven'
brew 'maven-completion'
brew 'fish'
brew 'starship'
brew 'kotlin'
brew 'postgresql@15'
brew 'python3'
brew 'awscli'
brew 'terraform'
brew 'kubernetes-cli'
brew 'jq'
brew 'imagemagick' # Used by TOMRA service-portal
brew 'cloud-sql-proxy'
brew 'rsync' # get the latest version

# Casks
cask 'slack'
cask 'google-chrome'
cask 'iterm2'
cask 'visual-studio-code'
cask 'jetbrains-toolbox'
cask 'docker'
cask 'spotify'
cask 'google-cloud-sdk'
cask 'alfred'
cask 'logi-options-plus'
cask 'postman'
cask 'authy'
cask 'microsoft-remote-desktop'
cask 'obsidian'

# Temurin Java
cask 'temurin'
cask 'temurin17'
cask 'temurin11'
